
[
  {
    "id": "doc1",
    "title": "Tame Impala Announces World Tour",
    "body": "Tame Impala announced a new world tour. Global distribution rights for their catalogue are managed directly by their distribution partner."
  },
  {
    "id": "doc2",
    "title": "Music Publishing Rights",
    "body": "Publishing rights cover the underlying composition. Taylor Swift's re-recordings highlight the importance of artists controlling their master rights."
  },
  {
    "id": "doc3",
    "title": "Digital Music Distribution",
    "body": "Services like DistroKid and TuneCore allow independent artists to upload music to Spotify and Apple Music."
  },
  {
    "id": "doc4",
    "title": "Billie Eilish's 'Happier Than Ever' Tour",
    "body": "Billie Eilish's 'Happier Than Ever' tour spanned multiple continents. Billie was indeed very happy"
  },
  {
    "id": "doc5",
    "title": "Accurate Music Metadata",
    "body": "Accurate metadata (ISRC, ISWC) is crucial for royalty payments. Incorrect data can lead to lost revenue for artists and songwriters."
  },
  {
    "id": "doc6",
    "title": "Sync Licensing Success",
    "body": "Kate Bush's 'Running Up That Hill' saw a massive resurgence after being featured in Stranger Things, thanks to internal licensing teams."
  },
  {
    "id": "doc7",
    "title": "Artist Management",
    "body": "An artist manager, like Scooter Braun for Justin Bieber, handles career strategy, tour booking, and contract negotiations."
  },
  {
    "id": "doc8",
    "title": "Metadata for Beyoncé's 'Renaissance'",
    "body": "The album 'Renaissance' by Beyoncé has extensive metadata, with dozens of writers and producers per track, each with individual ownership clauses."
  },
  {
    "id": "doc9",
    "title": "Music Copyright Law",
    "body": "Copyright law protects artists' work. The Marvin Gaye estate's lawsuit over 'Blurred Lines' is a famous case concerning composition copyright."
  },
  {
    "id": "doc10",
    "title": "Digital Royalty Calculation",
    "body": "Spotify uses a pro-rata model to calculate royalties, where an artist's stream share determines their portion of the platform's revenue pool."
  }
]
